:- use_module(library(clpfd)).%дл€ целых

podcast(bora).
podcast(acosta).
podcast(capon).
podcast(estrada).

y(2010).
y(2012).
y(2013).
y(2015).
year(N) :- y(N).

d(1).
d(2).
d(3).
d(4).
download(N) :- d(N).
%D-download
%P-podcast's name
%year
%s([P1-D1-Y1, P2-D2-Y2, P3-D3-Y3, P4-D4-Y4]) :-

different_list4([A,B,C,D]) :-
    A \= B, A \= C, A \= D,
            B \= C, B \= D,
                    C \= D.

sol(Solution) :-
    %перебор всех возможных вариантов.
    %4^12
    podcast(P1), download(D1), year(Y1),
    podcast(P2), download(D2), year(Y2),
    podcast(P3), download(D3), year(Y3),
    podcast(P4), download(D4), year(Y4),

    %отсекаем все варианты с повтором данных.
    %4!^3
    different_list4([P1,P2,P3,P4]),
    different_list4([D1,D2,D3,D4]),
    different_list4([Y1,Y2,Y3,Y4]),

    %1-а€ подсказка о том, что подкаст "AI Acosta" вышел в 2013.
    (
        (P1 = acosta, Y1 = 2013);
        (P2 = acosta, Y2 = 2013);
        (P3 = acosta, Y3 = 2013);
        (P4 = acosta, Y4 = 2013)),

    %5-а€ подсказка о том, что подкаст "Eva Estrada" вышел в 2015.
    (
        (P1 = estrada, Y1 = 2015);
        (P2 = estrada, Y2 = 2015);
        (P3 = estrada, Y3 = 2015);
        (P4 = estrada, Y4 = 2015)),

    %2-а€ подсказка о том, что подкаст, который вышел в 2015
    %имеет на 1 ћ»ЋЋ»ќЌ скачиваний ЅќЋ№Ў≈, чем подкаст "Bobby Bora".
    (
         (Y1 = 2015, (
                       (P2 = bora, D1 #= D2 + 1);
                       (P3 = bora, D1 #= D3 + 1);
                       (P4 = bora, D1 #= D4 + 1)));
         (Y2 = 2015, (
                       (P1 = bora, D2 #= D1 + 1);
                       (P3 = bora, D2 #= D3 + 1);
                       (P4 = bora, D2 #= D4 + 1)));
         (Y3 = 2015, (
                       (P1 = bora, D3 #= D1 + 1);
                       (P2 = bora, D3 #= D2 + 1);
                       (P4 = bora, D3 #= D4 + 1)));
         (Y4 = 2015, (
                       (P1 = bora, D4 #= D1 + 1);
                       (P2 = bora, D4 #= D2 + 1);
                       (P3 = bora, D4 #= D3 + 1)))),

    %3-€€ подсказка о том, что подкаст, который вышел в 2015 году имеет на 1 ћ»ЋЋ»ќЌ
    % скачиваний ћ≈Ќ№Ў≈, чем подкаст, который вышел в 2013 году.
    (
         (Y1 = 2015, (
                       (Y2 = 2013, D1 #= D2 - 1);
                       (Y3 = 2013, D1 #= D3 - 1);
                       (Y4 = 2013, D1 #= D4 - 1)));
         (Y2 = 2015, (
                       (Y1 = 2013, D2 #= D1 - 1);
                       (Y3 = 2013, D2 #= D3 - 1);
                       (Y4 = 2013, D2 #= D4 - 1)));
         (Y3 = 2015, (
                       (Y1 = 2013, D3 #= D1 - 1);
                       (Y2 = 2013, D3 #= D2 - 1);
                       (Y4 = 2013, D3 #= D4 - 1)));
         (Y4 = 2015, (
                       (Y1 = 2013, D4 #= D1 - 1);
                       (Y2 = 2013, D4 #= D2 - 1);
                       (Y3 = 2013, D4 #= D3 - 1)))),

    %4-а€ подсказка о том, что подкаст, которй вышел в 2013 году имеет на 1 ћ»ЋЋ»ќЌ
    % скачиваний ћ≈Ќ№Ў≈, чем подкаст, который вышел в 2012 году.
    (
         (Y1 = 2013, (
                       (Y2 = 2012, D1 #= D2 - 1);
                       (Y3 = 2012, D1 #= D3 - 1);
                       (Y4 = 2012, D1 #= D4 - 1)));
         (Y2 = 2013, (
                       (Y1 = 2012, D2 #= D1 - 1);
                       (Y3 = 2012, D2 #= D3 - 1);
                       (Y4 = 2012, D2 #= D4 - 1)));
         (Y3 = 2013, (
                       (Y1 = 2012, D3 #= D1 - 1);
                       (Y2 = 2012, D3 #= D2 - 1);
                       (Y4 = 2012, D3 #= D4 - 1)));
         (Y4 = 2013, (
                       (Y1 = 2012, D4 #= D1 - 1);
                       (Y2 = 2012, D4 #= D2 - 1);
                       (Y3 = 2012, D4 #= D3 - 1)))),

    %генерируем решение
    Solution = ([D1-P1-Y1, D2-P2-Y2, D3-P3-Y3, D4-P4-Y4]).


